Repository: sunfounder/sunfounder_vincent_kit_for_arduino
Catalog: docs/source/locale/*/LC_MESSAGES/1.10_state_change_detection.po
Languages: de

source: 1.10 State Change Detection
de: 1.10 Zustandsänderungserkennung

source: Overview
de: Überblick

source: When you use button, you can not only press down the button, light on the LED, release the button, turn off the LED, but also can switch the working state of the LED every time the button is pressed. In order to achieve this effect, you need to know when the state of the button changes from **off** to **on**, that is, "state change detection". In this lesson, we will print the results of state change detection of the button in the serial monitor.
de: Wenn Sie die Taste verwenden, können Sie nicht nur die Taste drücken, die LED aufleuchten lassen, die Taste loslassen, die LED ausschalten, sondern bei jedem Drücken der Taste auch den Betriebszustand der LED ändern. Um diesen Effekt zu erzielen, müssen Sie wissen, wann sich der Status der Schaltfläche von Aus nach Ein ändert, dh "Statusänderungserkennung". In dieser Lektion werden die Ergebnisse der Zustandsänderungserkennung der Schaltfläche im seriellen Monitor gedruckt.

source: Components Required
de: Erforderliche Komponenten

source: Refer to Part 2 to check details of hardware.
de: Informationen zur Hardware finden Sie in Teil 2.

source: In this example, we use pin 2 to read the signal of the button.
de: In diesem Beispiel verwenden wir Pin 2, um das Signal der Taste zu lesen.

source: Schematic Diagram
de: Schematische Darstellung

source: After the codes are uploaded into the Mega2560 board, the output number will switch between 0 and 1 every time you press the button.
de: Nachdem die Codes auf die Mega2560-Karte hochgeladen wurden, wechselt die Ausgangsnummer bei jedem Drücken der Taste zwischen 0 und 1.

source: Code Analysis
de: Code-Analyse

source: Declare a pin connected to Button.
de: Deklarieren Sie einen mit Button verbundenen Pin.

source: Declare a variable called 「detectionState」to record every state of state change detection.
de: Deklarieren Sie eine Variable mit dem Namen "DetectionState", um jeden Status der Statusänderungserkennung aufzuzeichnen.

source: Declare two variables to read the state of the button for state change detection.
de: Deklarieren Sie zwei Variablen, um den Status der Schaltfläche zur Erkennung von Statusänderungen zu lesen.

source: In setup(), initialize the pins and then start up the serial monitor.
de: Initialisieren Sie in setup () die Pins und starten Sie den seriellen Monitor.

source: In loop(), read the value of buttonPin and then assign to the variable buttonState.
de: Lesen Sie in loop () den Wert von buttonPin und weisen Sie ihn dann der Variablen buttonState zu.

source: Compare buttonState with lastButtonState, if they are not equal, it indicates that the state is changed. A delay(50) is needed to realize debouncing during the changing detection. After comparison, assign the buttonState to lastButtonState to make the next round of judgment.
de: Vergleichen Sie buttonState mit lastButtonState. Wenn diese nicht gleich sind, wird angezeigt, dass der Status geändert wurde. Eine Verzögerung (50) ist erforderlich, um das Entprellen während der Änderungserkennung zu realisieren. Weisen Sie nach dem Vergleich den buttonState dem lastButtonState zu, um die nächste Bewertungsrunde durchzuführen.

source: The state change judgment installed (buttonState != lastButtonState), the further judgment is made to get the condition「Press the button」.
de: Wenn das Statusänderungsurteil installiert ist (buttonState! = LastButtonState), wird das weitere Urteil getroffen, um das zu erhalten Bedingung 「Drücken Sie die Taste」.

source: Under the state「Press the button」, detectionState is being operated and it switches between 1 and 0. Meanwhile, the value of detectionState is printed.
de: Unter dem Status 「Drücken Sie die Taste」 wird der Erkennungsstatus ausgeführt und zwischen 1 und 0 umgeschaltet. In der Zwischenzeit wird der Wert von DetectionState gedruckt.

source: Phenomenon Picture
de: Phänomen Bild
