Repository: sunfounder/sunfounder_vincent_kit_for_arduino
Catalog: docs/source/locale/*/LC_MESSAGES/1.2_digital_write.po
Languages: de

source: 1.2 Digital Write
de: 1.2 Digitales Schreiben

source: Overview
de: Überblick

source: The digitalWrite() statement here is used to write high level or low level to pins and to let LED and active buzzer 「work 」or 「stop」. In this lesson, we will take LED as an example to introduce the experiment phenomenon.
de: Die Anweisung digitalWrite () wird hier verwendet, um hohem oder niedrigem Pegel in die Pins zu schreiben und die LED und den aktiven Summer 「arbeiten」 oder 「stoppen」 zu lassen. In dieser Lektion nehmen wir LED als Beispiel, um das Experimentphänomen vorzustellen.

source: Components Required
de: Erforderliche Komponenten

source: Refer to Part 2 to check details of hardware.
de: Informationen zur Hardware finden Sie in Teil 2.

source: In this example, we use digital pin 9 to drive the LED. Attach one side of the resistor to the digital pin 9 and the longer pin (anode) of the LED to the other side of the resistor. Connect the shorter pin (cathode) of the LED to GND.
de: In diesem Beispiel verwenden wir den digitalen Pin 9, um die LED anzusteuern. Verbinden Sie eine Seite des Widerstands mit dem digitalen Pin 9 und den längeren Pin (Anode) der LED mit der anderen Seite des Widerstands. Verbinden Sie den kürzeren Pin (cathode) der LED mit GND.

source: Schematic Diagram
de: Schematische Darstellung

source: After finishing the circuit connection, connect the Mega2560 board to the computer. Run the Arduino software IDE and type in the following codes.
de: Schließen Sie nach Abschluss der Schaltungsverbindung die Mega2560-Karte an den Computer an. Führen Sie die Arduino-Software-IDE aus und geben Sie die folgenden Codes ein.

source: You can also open the 1.2digitalWrite.ino file in the path of sunfounder_vincent_kit_for_arduino\code\1.2digitalWrite to use the codes.
de: Sie können die Datei 1.2digitalWrite.ino auch im Pfad von sunfounder_vincent_kit_for_arduino\code\1.2digitalWrite öffnen, um die Codes zu verwenden.

source: Upload the codes to the Mega2560 board, and you can see the blinking of LED.
de: Laden Sie die Codes auf die Mega2560-Karte hoch, und Sie können das Blinken der LED sehen.

source: Code Analysis
de: Code-Analyse

source: Here, we connect the LED to the digital pin 9, so we need to declare an int variable called ledpin at the beginning of the program and assign a value of 9.
de: Hier verbinden wir die LED mit dem digitalen Pin 9, daher müssen wir zu Beginn des Programms eine int-Variable namens ledpin deklarieren und den Wert 9 zuweisen.

source: Now, initialize the pin in the setup() function, where you need to initialize the pin to OUTPUT mode.
de: Initialisieren Sie nun den Pin in der Funktion setup (), wo Sie den Pin in den OUTPUT-Modus initialisieren müssen.

source: In loop(), digitalWrite() is used to provide 5V high level signal for ledpin, which will cause voltage difference between LED pins and light LED up.
de: In loop () wird digitalWrite () verwendet, um ein 5-V-Hochpegelsignal für den LED-Pin bereitzustellen, das eine Spannungsdifferenz zwischen den LED-Pins und dem Aufleuchten der LED verursacht.

source: If the level signal is changed to LOW, the ledPin's signal will be returned to 0 V to turn LED off.
de: Wenn das Pegelsignal auf LOW geändert wird, wird das LEDPin-Signal auf 0 V zurückgesetzt, um die LED auszuschalten.

source: An interval between on and off is required to allow people to see the change, so we use a delay(1000) code to let the controller do nothing for 1000 ms.
de: Ein Intervall zwischen Ein und Aus ist erforderlich, damit die Benutzer die Änderung sehen können. Daher verwenden wir einen delay(1000) Code, damit der Controller 1000 ms lang nichts tut.

source: ※ How to Upload the Sketch
de: ※ Wie laden Sie die Skizze hoch

source: Before you upload a written code to Arduino, you need first to select Board and Port.
de: Bevor Sie einen geschriebenen Code auf Arduino hochladen, müssen Sie zuerst Karte und Port auswählen.

source: Click Tools ->Board and select Arduino/Genuino Mega or Mega 2560.
de: Klicken Sie auf Extras -> Karte und wählen Sie Arduino / Genuino Mega oder Mega 2560.

source: Then select **Tools** ->\ **Port**. Your port should be different from mine.
de: Wählen Sie dann **Tools** ->\ **Port**. Ihr Port sollte sich von meinem unterscheiden.

source: **Step 4:** Upload the sketch to the SunFounder Mega2560 board. Click the **Upload** icon to upload the code to the control board.
de: **Schritt 4:** Laden Sie die Skizze auf das SunFounder Mega2560-Board hoch. Klicken Sie auf das Symbol **Hochladen**, um den Code auf die Steuerkarte hochzuladen.

source: If "Done uploading" appears at the bottom of the window, it means the sketch has been successfully uploaded.
de: Wenn unten im Fenster "Hochladen abgeschlossen" angezeigt wird, bedeutet dies, dass die Skizze erfolgreich hochgeladen wurde.

source: Phenomenon Picture
de: Phänomen Bild
