Repository: sunfounder/sunfounder_vincent_kit_for_arduino
Catalog: docs/source/locale/*/LC_MESSAGES/1.4_digital_read.po
Languages: de

source: 1.4 Digital Read
de: 1.4 Digitales Lesen

source: Overview
de: Überblick

source: You can use the digitalRead() command to read the level status from a digital pin. The command is suitable for digital input elements such as Button, Touch sensor, infrared motion sensor, etc. This article will take Button as an example to read the level state.
de: Mit dem Befehl digitalRead () können Sie den Pegelstatus von einem digitalen Pin lesen. Der Befehl eignet sich für digitale Eingabeelemente wie Taste, Berührungssensor, Infrarot-Bewegungssensor usw. In diesem Artikel wird Button als Beispiel zum Lesen des Ebenenstatus verwendet.

source: This example also shows you how to monitor the state of a switch by using USB to establish serial communication between a control board and a computer.
de: In diesem Beispiel wird auch gezeigt, wie Sie den Status eines Switches mithilfe von USB überwachen, um die serielle Kommunikation zwischen einer Steuerkarte und einem Computer herzustellen.

source: Components Required
de: Erforderliche Komponenten

source: Refer to Part 2 to check details of hardware.
de: Informationen zur Hardware finden Sie in Teil 2.

source: In this example, we read the signal of the button with the digital pin 2. When the button is not pressed, the digital pin 2 (through the drop-down resistor) is connected to ground to read the low level (0); when the button is pressed, the two pins are connected and when the pin is connected to the 5V power supply, the high level (1) is read.
de: In diesem Beispiel lesen wir das Signal der Taste mit dem digitalen Pin 2. Wenn die Taste nicht gedrückt wird, wird der digitale Pin 2 (über den Pulldown-Widerstand) geerdet, um den niedrigen Pegel (0) abzulesen. Wenn die Taste gedrückt wird, sind die beiden Pins verbunden, und wenn der Pin an eine 5-V-Stromversorgung angeschlossen ist, wird ein hoher Pegel (1) gelesen.

source: If you disconnect the digital I/O pin from everything, the LED may blink erratically. This is because the input is "floating" - that is, it doesn't have a solid connection to voltage or ground, and it will randomly return either HIGH or LOW. That's why you need a pull-down resistor in the circuit.
de: HINWEIS: Wenn Sie den digitalen E/A-Pin von allem trennen, blinkt die LED möglicherweise unregelmäßig. Dies liegt daran, dass der Eingang "schwebend" ist - das heißt, er hat keine feste Verbindung zu Spannung oder Masse und gibt zufällig entweder HIGH oder LOW zurück. Deshalb benötigen Sie einen Pulldown-Widerstand in der Schaltung.

source: Schematic Diagram
de: Schematische Darstellung

source: After uploading the code to the Mega2560 board, we can open the serial port monitor to see the reading value of the pin. When you press Button, the serial port monitor will display 「1」 and when Button is released, 「0」 will be displayed.
de: Nach dem Hochladen des Codes auf die Mega2560-Karte können wir den Monitor für die serielle Schnittstelle öffnen, um den Lesewert des Pins anzuzeigen. Wenn Sie die Taste drücken, zeigt der Monitor für die serielle Schnittstelle 「1」 an, und wenn die Taste losgelassen wird, wird 「0」 angezeigt.

source: Code Analysis
de: Code-Analyse

source: Start the serial communication in setup() and set the data rate to 9600.
de: Starten Sie die serielle Kommunikation in setup () und stellen Sie die Datenrate auf 9600 ein.

source: You also need to set the status of the digital pin 2 to INPUT to read the output status of Button.
de: Sie müssen auch den Status des digitalen Pins 2 auf INPUT setzen, um den Ausgangsstatus der Taste zu lesen.

source: Use the digitalRead() statement in loop() to read the level state of the digital pin 2 and declare a variable to store the state.
de: Verwenden Sie die Anweisung digitalRead () in loop (), um den Pegelstatus des digitalen Pins 2 zu lesen und eine Variable zum Speichern des Status zu deklarieren.

source: Print the value stored by the variable on the serial port monitor.
de: Drucken Sie den von der Variablen gespeicherten Wert auf dem Monitor der seriellen Schnittstelle.

source: Use delay() statements to make printing results easy to observe.
de: Verwenden Sie Verzögerung () -Anweisungen, um die Druckergebnisse leicht beobachten zu können.

source: ※ How to turn on Serial Port Monitor
de: ※ So schalten Sie den Serial Port Monitor ein

source: Click the magnifier icon at the top right of the Arduino IDE programming window to open the **Serial Monitor**.
de: Klicken Sie oben rechts im Arduino IDE-Programmierfenster auf das Lupensymbol, um den seriellen Monitor zu öffnen.

source: Phenomenon Picture
de: Phänomen Bild
