Repository: sunfounder/sunfounder_vincent_kit_for_arduino
Catalog: docs/source/locale/*/LC_MESSAGES/1.5_analog_read.po
Languages: de

source: 1.5 Analog Read
de: 1.5 Analog lesen

source: Overview
de: Überblick

source: You can use the analogRead() command to read analog input from the physical world through an analog pin, which is suitable for analog input elements such as potentiometers, photoresistance, water level detection sensors, and so on. This article will take the potentiometer as an example to read the analog value of its output.
de: Mit dem Befehl analogRead () können Sie analoge Eingänge aus der physischen Welt über einen analogen Pin lesen, der für analoge Eingangselemente wie Potentiometer, Fotowiderstand, Sensoren zur Erkennung des Wasserstandes usw. geeignet ist. In diesem Artikel wird das Potentiometer als Beispiel zum Ablesen des Analogwerts seines Ausgangs verwendet.

source: Components Required
de: Erforderliche Komponenten

source: In this example, we use the analog pin (A0) to read the value of the potentiometer. Connect the pins at both ends of the potentiometer to 5V and GND respectively. Connect the middle pin to A0.
de: In diesem Beispiel verwenden wir den analogen Pin (A0), um den Wert des Potentiometers abzulesen. Verbinden Sie die Stifte an beiden Enden des Potentiometers mit 5 V bzw. GND. Verbinden Sie den mittleren Pin mit A0.

source: The voltage of the middle pin will be output to the Mega2560 board as an analog value. By rotating the axis of the potentiometer, you can change the voltage on the middle pin, thereby changing the analog value of the pin obtained by A0.
de: Die Spannung des mittleren Pins wird als Analogwert an die Mega2560-Karte ausgegeben. Durch Drehen der Achse des Potentiometers können Sie die Spannung am mittleren Pin ändern, wodurch sich der Analogwert des von A0 erhaltenen Pins ändert.

source: Schematic Diagram
de: Schematische Darstellung

source: After the code is uploaded to the Mega2560 board, you can open the serial port monitor to view the reading value of the pin. When the shaft of the potentiometer is turned, the serial port monitor will print the value that changes between "0" and "1023".
de: Nachdem der Code auf die Mega2560-Karte hochgeladen wurde, können Sie den Monitor für die serielle Schnittstelle öffnen, um den Lesewert des Pins anzuzeigen. Wenn die Welle des Potentiometers gedreht wird, druckt der Monitor der seriellen Schnittstelle den Wert, der zwischen "0" und "1023" wechselt.

source: Code Analysis
de: Code-Analyse

source: To enable Arduino IDE to print the value transmitted from electronic component to the Mega2560 board, you need to start serial communication in setup() and set the data rate to 9600.
de: Damit Arduino IDE den von der elektronischen Komponente auf die Mega2560-Karte übertragenen Wert drucken kann, müssen Sie die serielle Kommunikation in setup () starten und die Datenrate auf 9600 einstellen.

source: Use the analoglRead() statement in loop() to read the level state acquired by analog pin A0 and declare a variable to store the level state.
de: Verwenden Sie die Anweisung analoglRead () in loop (), um den vom analogen Pin A0 erfassten Pegelzustand zu lesen und eine Variable zum Speichern des Pegelzustands zu deklarieren.

source: Print the value stored in the variable on the serial monitor.
de: Drucken Sie den in der Variablen gespeicherten Wert auf dem seriellen Monitor.

source: Use delay() statements to make printing results easy to observe.
de: Verwenden Sie Verzögerung () -Anweisungen, um die Druckergebnisse leicht beobachten zu können.

source: ※ Analog-to-Digital Converter
de: ※ Analog-Digital-Wandler

source: The Arduino have a circuit inside called an analog-to-digital converter or ADC that reads this changing voltage and converts it to a number between 0 and 1023. When the shaft is turned all the way in one direction, there are 0 volts going to the pin, and the input value is 0. When the shaft is turned all the way in the opposite direction, there are 5 volts going to the pin and the input value is 1023. In between, analogRead() returns a number between 0 and 1023 that is proportional to the amount of voltage being applied to the pin.
de: Das Arduino verfügt über eine Schaltung, die als Analog-Digital-Wandler oder ADC bezeichnet wird und diese sich ändernde Spannung liest und in eine Zahl zwischen 0 und 1023 umwandelt. Wenn die Welle vollständig in eine Richtung gedreht wird, werden 0 Volt an den Stift angelegt, und der Eingangswert ist 0. Wenn die Welle vollständig in die entgegengesetzte Richtung gedreht wird, werden 5 Volt an den Stift angelegt und der Eingangswert beträgt 1023. Dazwischen gibt analogRead () eine Zahl zwischen 0 und 1023 zurück, die proportional zur an den Pin angelegten Spannung ist.

source: Phenomenon Picture
de: Phänomen Bild
