Repository: sunfounder/sunfounder_vincent_kit_for_arduino
Catalog: docs/source/locale/*/LC_MESSAGES/1.6_digital_input_control_output.po
Languages: de

source: 1.6 Digital Input Control Output
de: 1.6 Steuerung des digitalen Eingangs

source: Overview
de: Überblick

source: With the understanding of digitalWrite() and digitalRead(), we can build a complete I / O system to control the output device by obtaining the data from the input device. We can use this method to enable digital input components such as Button, Touch sensor, Infrared motion sensor to control digital output devices such as LED, active buzzer. This lesson will take Button and LED as examples to realize button control LED with the condition (if-else).
de: Mit dem Verständnis von digitalWrite () und digitalRead () können wir ein vollständiges E / A-System zur Steuerung des Ausgabegeräts erstellen, indem wir die Daten vom Eingabegerät abrufen. Mit dieser Methode können digitale Eingabekomponenten (wie Tasten, Berührungssensoren, Infrarot-Bewegungssensoren) digitale Ausgabegeräte (wie LEDs, aktive Summer) steuern. In dieser Lektion werden Taste und LED als Beispiele verwendet, um die LED zur Steuerung der Taste mit der Bedingung (falls nicht anders) zu realisieren.

source: Components Required
de: Erforderliche Komponenten

source: Refer to Part 2 to check details of hardware.
de: Informationen zur Hardware finden Sie in Teil 2.

source: In this example, we use pin 9 to drive LED. Use digital pin 2 to read the signal of Button. When the button is pressed, the LED lights up.
de: In diesem Beispiel verwenden wir Pin 9, um die LED anzusteuern. Verwenden Sie den digitalen Pin 2, um das Signal der Taste zu lesen. Wenn die Taste gedrückt wird, leuchtet die LED auf.

source: Schematic Diagram
de: Schematische Darstellung

source: After uploading the code to the Mega2560 board, you can hold down Button to lighten the LED.
de: Nachdem Sie den Code auf die Mega2560-Karte hochgeladen haben, können Sie die Taste gedrückt halten, um die LED aufzuhellen.

source: Code Analysis
de: Code-Analyse

source: Declare the pins of LED and Button and declare a variable to store the state of button.
de: Deklarieren Sie die Pins von LED und Button und deklarieren Sie eine Variable, um den Status der Button zu speichern.

source: Initialize the pin mode in setup().
de: Initialisieren Sie den Pin-Modus in setup ().

source: Read the status of the Button in loop() and assign it to the variable buttonState.
de: Lesen Sie den Status des Buttons in loop () und weisen Sie ihn der Variablen buttonState zu.

source: Use if condition to judge: if you get high level from a button, light up the LED.
de: Verwenden Sie die if-Bedingung, um zu beurteilen: Wenn Sie einen hohen Pegel von einer Taste erhalten, leuchten Sie die LED auf.

source: Otherwise, turn off the LED.
de: Andernfalls schalten Sie die LED aus.

source: Phenomenon Picture
de: Phänomen Bild
