Repository: sunfounder/sunfounder_vincent_kit_for_arduino
Catalog: docs/source/locale/*/LC_MESSAGES/1.7_analog_input_control_output.po
Languages: de

source: 1.7 Analog Input Control Output
de: 1.7 Analogeingang Steuerausgang

source: Overview
de: Überblick

source: You can install an I/O system by using an analog input/ output device. For example, you can use potentiometer, photoresistor, water level sensor, etc., to control the brightness of LED, the speed of motor, and the like. In this lesson, potentiometer and LED are taken as examples to change the brightness of the LED when the potentiometer is turning.
de: Sie können ein E / A-System mithilfe eines analogen Ein- / Ausgabegeräts installieren. Beispielsweise können Sie ein Potentiometer, einen Fotowiderstand, einen Wasserstandssensor usw. verwenden, um die Helligkeit der LED, die Motordrehzahl und dergleichen zu steuern. In dieser Lektion werden Potentiometer und LED als Beispiele verwendet, um die Helligkeit der LED zu ändern, wenn sich das Potentiometer dreht.

source: Components Required
de: Erforderliche Komponenten

source: Refer to Part 2 to check details of hardware.
de: Informationen zur Hardware finden Sie in Teil 2.

source: In this lesson, we use PWM pin 9 to drive LED. The analog pin (A0) is used to read the value of potentiometer. After uploading the code, you'll notice that the brightness of the LED changes as the potentiometer rotates.
de: In dieser Lektion verwenden wir PWM-Pin 9, um die LED anzusteuern. Der analoge Pin (A0) dient zum Ablesen des Potentiometerwerts. Nach dem Hochladen des Codes werden Sie feststellen, dass sich die Helligkeit der LED ändert, wenn sich das Potentiometer dreht.

source: Schematic Diagram
de: Schematische Darstellung

source: When the codes are uploaded to the Mega2560 board, you can see that the brightness of LED is changing with the turning of the knob of potentiometer.
de: Wenn die Codes auf die Mega2560-Karte hochgeladen werden, können Sie sehen, dass sich die Helligkeit der LED mit dem Drehen des Potentiometerknopfs ändert.

source: Code Analysis
de: Code-Analyse

source: Declare the pins of LED and Button.
de: Deklarieren Sie die Pins von LED und Button.

source: In setup(), set the mode of ledPin to OUTPUT.
de: Stellen Sie in setup () den Modus von ledPin auf OUTPUT ein.

source: Read the readings of potentiometer in loop().
de: Lesen Sie die Messwerte des Potentiometers in loop () ab.

source: Map the potentiometer reading to the LED brightness value (0-1024 is mapped to 0-255).
de: Ordnen Sie den Potentiometerwert dem LED-Helligkeitswert zu (0-1024 ist 0-255 zugeordnet).

source: Write the brightness value to LED.
de: Schreiben Sie den Helligkeitswert auf die LED.

source: Phenomenon Picture
de: Phänomen Bild
