Repository: sunfounder/sunfounder_vincent_kit_for_arduino
Catalog: docs/source/locale/*/LC_MESSAGES/1.8_serial_read.po
Languages: de

source: 1.8 Serial Read
de: 1.8 Serielles Lesen

source: Overview
de: Überblick

source: In addition to reading data from the electronic components, the Mega2560 board can read the data input in the serial port monitor, and you can use Serial.read() as the controller of the circuit experiment. Then we use LED to experiment with the Serial. Read() statement to control LED to turn on and off.
de: Neben dem Lesen von Daten aus elektronischen Bauteilen kann die Mega2560-Karte auch Daten lesen, die im Monitor der seriellen Schnittstelle eingegeben wurden, und Sie können Serial.read () als Controller für Schaltungsexperimente verwenden. Dann verwenden wir LED, um mit der Seriennummer zu experimentieren. Read () - Anweisung zur Steuerung der LED zum Ein- und Ausschalten.

source: Components Required
de: Erforderliche Komponenten

source: Refer to Part 2 to check details of hardware.
de: Informationen zur Hardware finden Sie in Teil 2.

source: In this example, we use digital pin 9 to drive LED. When 1 is entered in serial monitor, the LED lights up. When 0 is entered, the LED turns off.
de: In diesem Beispiel verwenden wir den digitalen Pin 9, um die LED anzusteuern. Wenn 1 in den seriellen Monitor eingegeben wird, leuchtet die LED auf. Wenn 0 eingegeben wird, erlischt die LED.

source: Schematic Diagram
de: Schematische Darstellung

source: After the codes are uploaded to the Mega2560 board, please turn on the serial port monitor. Typing in ”1” can make LED turn on and typing in ”0” can make it turn off.
de: Nachdem die Codes auf die Mega2560-Karte hochgeladen wurden, schalten Sie bitte den Monitor für die serielle Schnittstelle ein. Wenn Sie "1" eingeben, wird die LED eingeschaltet, und wenn Sie "0" eingeben, wird sie möglicherweise ausgeschaltet.

source: Code Analysis
de: Code-Analyse

source: Declare digital pin 9 as ledPin.
de: Deklarieren Sie den digitalen Pin 9 als LEDPin.

source: Serial.read() reads a single byte of ASCII value, and therefore you need to declare a int type variable, incomingByte to store the acquired data.
de: Serial.read () liest ein einzelnes Byte des ASCII-Werts. Daher müssen Sie eine Variable vom Typ int, incomingByte, deklarieren, um die erfassten Daten zu speichern.

source: Run the serial communication in setup() and set the data rate to 9600.
de: Führen Sie die serielle Kommunikation in setup () aus und stellen Sie die Datenrate auf 9600 ein.

source: Set ledPin to OUTPUT mode.
de: Stellen Sie ledPin auf den OUTPUT-Modus.

source: The state of serial port monitor is judged in loop(), and the information processing will be carried out only when the data are received.
de: Der Status des seriellen Port-Monitors wird in loop () beurteilt, und die Informationsverarbeitung wird nur ausgeführt, wenn die Daten empfangen werden.

source: Reads the input value in the serial port monitor and stores it to the variable incomingByte.
de: Liest den Eingabewert im Monitor der seriellen Schnittstelle und speichert ihn in der Variablen incomingByte.

source: When the character '1' is obtained, the LED is lit; when ’0’ is obtained, the LED turns off.
de: Wenn das Zeichen '1' erhalten wird, leuchtet die LED; Wenn '0' erhalten wird, erlischt die LED.

source: Serial.read() takes the ASCII value in single character, which means that when you input '1', the obtained value is not the number '1', but the character '1' whose corresponding ASCII value is 49.
de: Nimmt den ASCII-Wert in einem einzelnen Zeichen an. Wenn Sie also '1' eingeben, ist der erhaltene Wert nicht die Zahl '1', sondern das Zeichen '1', dessen entsprechender ASCII-Wert 49 ist.

source: ※ ASCII chart
de: ※ ASCII-Diagramm

source: The ASCII (American Standard Code for Information Interchange) encoding dates to the 1960's. It is the standard way that text is encoded numerically.
de: Die ASCII-Codierung (American Standard Code for Information Interchange) stammt aus den 1960er Jahren. Es ist die Standardmethode, mit der Text numerisch codiert wird.

source: Note that the first 32 characters (0-31) are non-printing characters, often called control characters. The more useful characters have been labeled.
de: Beachten Sie, dass die ersten 32 Zeichen (0-31) nicht druckbare Zeichen sind, die häufig als Steuerzeichen bezeichnet werden. Die nützlicheren Zeichen wurden beschriftet.

source: Phenomenon Picture
de: Phänomen Bild
