Repository: sunfounder/sunfounder_vincent_kit_for_arduino
Catalog: docs/source/locale/*/LC_MESSAGES/2.15_button.po
Languages: de

source: 2.15 Button
de: 2.15 Taste

source: Overview
de: Überblick

source: In this lesson, you will learn about Button. Button is a common component used to control electronic devices. It is usually used as a switch to connect or break circuits.
de: In dieser Lektion lernen Sie Taste kennen. Die Taste ist eine übliche Komponente zur Steuerung elektronischer Geräte. Es wird normalerweise als Schalter zum Anschließen oder Unterbrechen von Stromkreisen verwendet.

source: Components Required
de: Erforderliche Komponenten

source: Component Introduction
de: Komponenteneinführung

source: Two pins on the left are connected, and the one on the right is similar to the left, which is shown below:
de: Links sind zwei Stifte verbunden, und der rechte ähnelt dem links gezeigten, der unten gezeigt wird:

source: The symbol shown as below is usually used to represent a button in circuits.
de: Das unten gezeigte Symbol wird normalerweise verwendet, um eine Schaltfläche in Schaltkreisen darzustellen.

source: When the button is pressed, the 4 pins are connected, thus closing the circuit.
de: Wenn die Taste gedrückt wird, werden die 4 Pins verbunden, wodurch der Stromkreis geschlossen wird.

source: In this example, we read the signal of the button with the digital pin 2. When the button is not pressed, the digital pin 2 (through the drop-down resistor) is connected to ground to read the low level (0); when the button is pressed, the two pins are connected and when the pin is connected to the 5V power supply, the high level (1) is read.
de: In diesem Beispiel lesen wir das Signal der Taste mit dem digitalen Pin 2. Wenn die Taste nicht gedrückt wird, wird der digitale Pin 2 (über den Pulldown-Widerstand) geerdet, um den niedrigen Pegel (0) abzulesen. Wenn die Taste gedrückt wird, sind die beiden Pins verbunden, und wenn der Pin an eine 5-V-Stromversorgung angeschlossen ist, wird ein hoher Pegel (1) gelesen.

source: If you disconnect the digital I/O pin from anything, the LED may blink erratically. The input is "floating" or it doesn't have a solid connection to voltage or ground, so it will randomly return either HIGH or LOW. That's why there needs a pull-down resistor in the circuit.
de: HINWEIS: Wenn Sie den digitalen E / A-Pin von irgendetwas trennen, blinkt die LED möglicherweise unregelmäßig. Der Eingang ist "schwebend" oder hat keine feste Verbindung zu Spannung oder Masse, so dass er zufällig entweder HIGH oder LOW zurückgibt. Deshalb braucht es einen Pulldown-Widerstand in der Schaltung.

source: Schematic Diagram
de: Schematische Darstellung

source: **Example 1：**
de: **Beispiel 1:**

source: Uploaded the codes to the Mega2560 board, you can see the readings of the pins on the serial monitor. When you press down the Button, there will display 「1」on the serial monitor, and once you release it, there will display「0」. As for the detail code explanation, please refer to **Part 1-1.4 Digital Read.**
de: Wenn Sie die Codes auf die Mega2560-Karte hochgeladen haben, können Sie die Messwerte der Pins auf dem seriellen Monitor sehen. Wenn Sie die Taste drücken, wird auf dem seriellen Monitor 「1」 angezeigt, und sobald Sie ihn loslassen, wird 「0」 angezeigt. Einzelheiten zur Erläuterung des Detailcodes finden Sie in **Teil 1- 1.4 Digital Read**.

source: **Example 2：**
de: **Beispiel 2:**

source: Uploaded the codes to the Mega2560 board, every time you press the button, the output value will switch between 0 and 1. If you want to know more about the code explanation, you can turn to **Part 1-1.10 State Change Detection.**
de: Wenn Sie die Codes auf die Mega2560-Karte hochladen, wechselt der Ausgabewert jedes Mal, wenn Sie die Taste drücken, zwischen 0 und 1. Wenn Sie mehr über die Code-Erklärung erfahren möchten, wenden Sie sich an **Teil 1 - 1.10 Statusänderungserkennung**.

source: Phenomenon Picture
de: Phänomen Bild
