Repository: sunfounder/sunfounder_vincent_kit_for_arduino
Catalog: docs/source/locale/*/LC_MESSAGES/2.17_tilt_switch.po
Languages: de

source: 2.17 Tilt Switch
de: 2.17 Neigungsschalter

source: **Overview**
de: **Überblick**

source: In this lesson, you will learn about tilt switch. Tilt switch can be used to detect whether objects tilt, which is of great value in practical applications. It can be used to judge the tilt of bridges, buildings, transmission line tower and so on, so it has an important guiding function in carrying out maintenance work.
de: In dieser Lektion lernen Sie den Neigungsschalter kennen. Mit dem Neigungsschalter kann festgestellt werden, ob Objekte geneigt sind, was in praktischen Anwendungen von großem Wert ist. Es kann verwendet werden, um die Neigung von Brücken, Gebäuden, Übertragungsleitungstürmen usw. zu beurteilen, sodass es eine wichtige Führungsrolle bei Wartungsarbeiten spielt.

source: **Components Required**
de: **Erforderliche Komponenten**

source: **Component Introduction**
de: **Komponenteneinführung**

source: The principle is very simple. When the switch is tilted in a certain angle, the ball inside rolls down and touches the two contacts connected to the pins outside, thus triggering circuits. Otherwise the ball will stay away from the contacts, thus breaking the circuits.
de: Das Prinzip ist sehr einfach. Wenn der Schalter in einem bestimmten Winkel gekippt wird, rollt die interne Kugel nach unten und berührt die beiden mit den externen Stiften verbundenen Kontakte, wodurch die Schaltung ausgelöst wird. Andernfalls bleibt der Ball von den Kontakten fern und unterbricht die Stromkreise.

source: In this example, digital pin 2 is used to read the signal of Tilt Switch.
de: In diesem Beispiel wird der digitale Pin 2 zum Lesen des Signals des Neigungsschalters verwendet.

source: **Schematic Diagram**
de: **Schematische Darstellung**

source: After the codes are uploaded to the Mega2560 board, you can open the serial monitor to see the readings of pins, which displays 「1」 or 「0」 when Tilt Switch is vertical (bringing the internal metal ball into contacting with the Wire Pins) or tilted. For detailed explanation of codes, you can turn to :ref:`1.4 Digital Read`.
de: Nachdem Sie den Code auf die Mega2560-Karte hochgeladen haben, können Sie den seriellen Monitor öffnen, um die Anzeige des Pins anzuzeigen, auf dem「1」 oder「0」angezeigt wird, wenn der Neigungsschalter vertikal ist (so dass die innere Metallkugel den Drahtstift berührt) oder gekippt ist. Eine ausführliche Erläuterung der Codes finden Sie in `Teil 1- 1.4 Digital Read`.

source: **Phenomenon Picture**
de: **Phänomen Bild**
