Repository: sunfounder/sunfounder_vincent_kit_for_arduino
Catalog: docs/source/locale/*/LC_MESSAGES/2.1_acommon_component.po
Languages: de

source: 2.1 Common Component
de: 2.1 Gemeinsame Komponente

source: Overview
de: Überblick

source: This lesson introduces some common components, including breadboard, jump wires, resistor, capacitor, transistor, diode, Prototype Shield and so on.
de: In dieser Lektion werden einige gängige Komponenten vorgestellt, darunter Steckbrett, Sprungdrähte, Widerstand, Kondensator, Transistor, Diode, Prototype Shield usw.

source: Breadboard
de: Steckbrett

source: A breadboard is a construction base for prototyping of electronics. It is used to build and test circuits quickly before finalizing any circuit design. And it has many holes into which components like ICs and resistors as well as jumper wires mentioned above can be inserted. The breadboard allows you to easily plug in and remove components. So if there are going to be many changes or if you just want to make a circuit quickly, it will be much quicker than soldering up your circuit. Therefore in lots of experiments, it is often used as a hub to connect two or more devices.
de: Ein Steckbrett ist eine Konstruktionsbasis für das Prototyping von Elektronik. Es kann verwendet werden, um Schaltungen schnell aufzubauen und zu testen, bevor ein Schaltungsdesign abgeschlossen wird. Und es hat viele Löcher zum Einsetzen von Komponenten wie den oben genannten ICs, Widerständen und Jumpern. Mit dem Steckbrett können Sie problemlos Komponenten einsetzen und entfernen. Wenn es also viele Änderungen geben wird oder wenn Sie nur schnell eine Schaltung erstellen möchten, ist dies viel schneller als das Löten Ihrer Schaltung. Daher wird es in vielen Experimenten häufig als Hub verwendet, um zwei oder mehr Geräte zu verbinden.

source: This is the internal structure of a full+ breadboard. Although there are holes on the breadboard, **internally some of them are connected with metal strips**. Those holes are to insert pins of devices or wires. There are four long metal strips on the long sides; the blue and red lines are marked just for clear observation. But you can take the blue line as the GND and red one as VCC for convenience. Every five holes in the middle are vertically connected with metal trips internally which don’t connect with each other. You can connect them horizontally with wires or components. A groove is made in the middle on the breadboard for IC chips.
de: Dies ist die interne Struktur eines Full + Breadboards. Obwohl das Steckbrett Löcher aufweist, **sind einige von ihnen intern mit Metallstreifen verbunden**. Diese Löcher dienen zum Einführen von Stiften von Geräten oder Drähten. An den langen Seiten befinden sich vier lange Metallstreifen. Die blauen und roten Linien sind nur zur klaren Beobachtung markiert. Sie können jedoch die blaue Linie als GND und die rote als VCC verwenden. Alle fünf Löcher in der Mitte sind vertikal mit den Metallauslösungen im Inneren verbunden, und die Metallauslösungen sind nicht miteinander verbunden. Sie können sie horizontal mit Drähten oder Komponenten verbinden. In der Mitte des Steckbretts befindet sich eine Nut für IC-Chips.

source: Jumper Wires
de: Überbrückungsdrähte

source: Wires that connect two terminals are called jumper wires. There are various kinds of jumper wires. Here we focus on those used in breadboard. Among others, they are used to transfer electrical signals from anywhere on the breadboard to the input/output pins of a microcontroller.
de: Drähte, die zwei Klemmen verbinden, werden als Überbrückungsdrähte bezeichnet. Es gibt verschiedene Arten von Überbrückungsdrähten. Hier konzentrieren wir uns auf diejenigen, die in Steckbrettern verwendet werden. Sie werden unter anderem verwendet, um elektrische Signale von irgendwo auf dem Steckbrett an die Eingangs- / Ausgangspins des Mikrocontrollers zu übertragen.

source: Jump wires are fitted by inserting their "end connectors" into the slots provided in the breadboard, beneath whose surface there are a few sets of parallel plates that connect the slots in groups of rows or columns depending on the area. The "end connectors" are inserted into the breadboard, without soldering, in the particular slots that need to be connected in the specific prototype.
de: Durch Einsetzen des "Endverbinders" des Jumpers in den im Steckbrett vorgesehenen Steckplatz kann der Jumper installiert werden. Unter der Oberfläche befinden sich mehrere Gruppen paralleler Platinen, die die Steckplätze je nach Bereich in Reihen oder Spalten verbinden. Der "Endverbinder" kann in den spezifischen Steckplatz eingesetzt werden, der im spezifischen Prototyp des Steckbretts ohne Löten angeschlossen werden muss.

source: There are three types of jumper wire: Female-to-Female, Male-to-Male, and Male-to-Female. The reason we call it Male-to-Female is because it has the outstanding tip in one end as well as a sunk female end. Male-to-Male means both side are male and Female-to-Female means both ends are female.
de: Es gibt drei Arten von Überbrückungskabeln: Buchse zu Buchse, Stecker zu Stecker und Stecker zu Buchse. Der Grund, warum wir es von Mann zu Frau nennen, ist, dass es die herausragende Spitze an einem Ende sowie ein versenktes weibliches Ende hat. Mann-zu-Mann bedeutet, dass beide Seiten männlich sind, und Frau-zu-Frau bedeutet, dass beide Enden weiblich sind.

source: More than one type of them may be used in a project. **The color of the jump wires is different but it doesn’t mean their function is different accordingly; it's just designed so to better identify the connection between each circuit**.
de: In einem Projekt können mehrere Typen verwendet werden. **Die Farbe der Sprungdrähte ist unterschiedlich, dies bedeutet jedoch nicht, dass ihre Funktion entsprechend unterschiedlich ist. Es wurde nur entwickelt, um die Verbindung zwischen den einzelnen Schaltkreisen besser zu identifizieren.**

source: Resistor
de: Widerstand

source: Resistor is an electronic element that can limit the branch current. A fixed resistor is one whose resistance cannot be changed, when that of a potentiometer or variable resistor can be adjusted.
de: Der Widerstand ist ein elektronisches Element, das den Zweigstrom begrenzen kann. Der feste Widerstand bezieht sich auf den Widerstand, der nicht geändert werden kann, wenn das Potentiometer oder der variable Widerstand eingestellt werden kann.

source: The resistors in this kit are fixed ones. It is essential in the circuit to protect the connected components. The following pictures show a real 220Ω resistor and two generally used circuit symbols for resistor. Ω is the unit of resistance and the larger includes KΩ, MΩ, etc. Their relationship can be shown as follows: 1 MΩ=1000 KΩ, 1 KΩ = 1000 Ω, which means 1 MΩ = 1000,000 Ω = 10^6 Ω. Normally, the resistance is marked on it. So if you see these symbols in a circuit, it stands for a resistor.
de: Die Widerstände in diesem Kit sind fest. In der Schaltung ist es wichtig, die angeschlossenen Komponenten zu schützen. Die folgenden Bilder zeigen einen echten 220Ω-Widerstand und zwei allgemein verwendete Schaltungssymbole für den Widerstand. Ω ist die Widerstandseinheit und die größere enthält KΩ, MΩ usw. Ihre Beziehung kann wie folgt gezeigt werden: 1 MΩ = 1000 KΩ, 1 KΩ = 1000 Ω, was 1 MΩ = 1000.000 Ω = 10 ^ 6 Ω bedeutet. Normalerweise ist der Widerstand darauf markiert. Wenn Sie diese Symbole in einer Schaltung sehen, steht sie für einen Widerstand.

source: The resistance can be marked directly, in color code, and by character. The resistors offered in this kit are marked by different colors. Namely, the bands on the resistor indicate the resistance.
de: Der Widerstand kann direkt, im Farbcode und nach Zeichen markiert werden. Die in diesem Kit angebotenen Widerstände sind durch verschiedene Farben gekennzeichnet. Die Bänder am Widerstand geben nämlich den Widerstand an.

source: When using a resistor, we need to know its resistance first. Here are two methods: you can observe the bands on the resistor, or use a multimeter to measure the resistance. You are recommended to use the first method as it is more convenient and faster. If you are not sure about the value, use the multimeter.
de: Wenn wir einen Widerstand verwenden, müssen wir zuerst seinen Widerstand kennen. Es gibt zwei Methoden: Sie können das Frequenzband am Widerstand beobachten oder den Widerstand mit einem Multimeter messen. Es wird empfohlen, die erste Methode zu verwenden, da diese bequemer und schneller ist. Wenn Sie sich über den Wert nicht sicher sind, verwenden Sie das Multimeter.

source: As shown in the card, each color stands for a number.
de: Wie auf der Karte gezeigt, steht jede Farbe für eine Zahl.

source: Capacitor
de: Kondensator

source: The capacitor is a component that has the capacity to store energy in the form of electrical charge or to produce a potential difference (Static Voltage) between its plates, much like a small rechargeable battery.
de: Ein Kondensator ist eine Komponente, die Energie in Form von elektrischer Ladung speichert oder eine Potentialdifferenz (statische Spannung) zwischen ihren Platten erzeugt, genau wie eine kleine wiederaufladbare Batterie.

source: Standard Units of Capacitance
de: Standardkapazitätseinheiten

source: Microfarad (μF) 1μF = 1/1,000,000 = 0.000001 = :math:`10^{- 6}` F
de: Mikrofarad (μF) 1μF = 1/1,000,000 = 0.000001 = :math:`10^{- 6}` F

source: Here we shown **104 capacitor(10 x 104PF)**. Just like the ring of resistors, the numbers on the capacitors help to read the values once assembled onto the board. The first two digits represent the value and the last digit of the number means the multiplier. Thus 104 represents a power of 10 x 10 to 4 (in pF) equal to 100 nF.
de: Hier haben wir **104 Kondensatoren (10 x 104PF)** gezeigt. Genau wie beim Ring der Widerstände helfen die Zahlen auf den Kondensatoren beim Ablesen der Werte, sobald sie auf der Platine montiert sind. Die ersten beiden Ziffern stellen den Wert dar und die letzte Ziffer der Zahl bedeutet den Multiplikator. Somit repräsentiert 104 eine Potenz von 10 × 10 bis 4 (in pF) gleich 100 nF.

source: Transistor is a semiconductor device that controls current by current. It functions by amplifying weak signal to larger amplitude signal and is also used for non-contact switch. A transistor is a three-layer structure composed of P-type and N-type semiconductors. They form the three regions internally. The thinner in the middle is the base region; the other two are both N-type or P-type ones – the smaller region with intense majority carriers is the emitter region, when the other one is the collector region. This composition enables the transistor to be an amplifier.
de: Der Transistor ist ein Halbleiterbauelement, das Strom für Strom steuert. Es verstärkt schwaches Signal auf Signal mit größerer Amplitude und wird auch für berührungslose Schalter verwendet. Ein Transistor ist eine dreischichtige Struktur, die aus Halbleitern vom P-Typ und N-Typ besteht. Sie bilden die drei Regionen intern. Der dünnere Teil in der Mitte ist die Grundfläche, die anderen beiden sind entweder vom N-Typ oder vom P-Typ - der kleinere Bereich mit der Mehrheit der Träger ist der Emitterbereich und der andere ist der Kollektorbereich. Diese Zusammensetzung ermöglicht es dem Transistor, ein Verstärker zu sein.

source: From these three regions, three poles are generated respectively, which are base (b), emitter (e), and collector (c). They form two P-N junctions, namely, the emitter junction and collection junction. The direction of the arrow in the transistor circuit symbol indicates that of the emitter junction. Based on the semiconductor type, transistors can be divided into two groups, the NPN and PNP ones. From the abbreviation, we can tell that the former is made of two N-type semiconductors and one P-type and that the latter is the opposite. See the figure below.
de: Aus diesen drei Regionen werden jeweils drei Pole erzeugt, nämlich Basis (b), Emitter (e) und Kollektor (c). Sie bilden zwei PN-Übergänge, nämlich den Emitterübergang und den Sammelübergang. Die Pfeilrichtung im Transistorschaltungssymbol gibt die Richtung des Emitterübergangs an. Basierend auf dem Halbleitertyp können Transistoren in zwei Gruppen unterteilt werden, die NPN- und die PNP-Gruppe. Aus der Abkürzung ist ersichtlich, dass der erstere aus zwei Halbleitern vom N-Typ und einem P-Typ besteht, während der letztere das Gegenteil ist Siehe die Abbildung unten.

source: When a High level signal goes through an NPN transistor, it is energized. But a PNP one needs a Low level signal to manage it.
de: Wenn ein Signal mit hohem Pegel einen NPN-Transistor durchläuft, wird es erregt. Ein PNP benötigt jedoch ein Low-Level-Signal, um es zu verwalten.

source: A diode is a two-terminal component in electronics with a unidirectional flow of current. It offers low resistance in the direction of current flow and offers high resistance in the opposite direction. Diodes are mostly used to prevent damage to components, especially due to electromotive force in circuits which are usually polarized.
de: Eine Diode ist eine zweipolige Komponente in der Elektronik mit einem unidirektionalen Stromfluss. Es bietet einen geringen Widerstand in Richtung des Stromflusses und einen hohen Widerstand in der entgegengesetzten Richtung. Dioden werden meistens verwendet, um Schäden an Bauteilen zu vermeiden, insbesondere aufgrund elektromotorischer Kraft in Schaltkreisen, die normalerweise polarisiert sind.

source: The two terminals of a diode are polarized, with the positive end called anode and the negative end called cathode. The cathode is usually made of silver or has a color band. Controlling the direction of current flow is one of the key features of diodes — the current in a diode flows from anode to cathode. The behavior of a diode is similar to the behavior of a check valve. One of the most important characteristics of a diode is the non-linear current voltage. If higher voltage is connected to the anode, then current flows from anode to cathode, and the process is known as forward bias. However, if the higher voltage is connected to the cathode, then the diode does not conduct electricity, and the process is called reverse bias.
de: Die beiden Anschlüsse einer Diode sind polarisiert, wobei das positive Ende als Anode und das negative Ende als Kathode bezeichnet wird. Die Kathode besteht üblicherweise aus Silber oder hat ein Farbband. Die Steuerung der Stromflussrichtung ist eines der Hauptmerkmale von Dioden - der Strom in einer Diode fließt von Anode zu Kathode. Das Verhalten einer Diode ähnelt dem Verhalten eines Rückschlagventils. Eine der wichtigsten Eigenschaften einer Diode ist die nichtlineare Stromspannung. Wenn eine höhere Spannung an die Anode angeschlossen ist, fließt Strom von Anode zu Kathode, und der Prozess wird als Vorwärtsvorspannung bezeichnet. Wenn jedoch die höhere Spannung an die Kathode angeschlossen ist, leitet die Diode keine Elektrizität, und der Prozess wird als Sperrvorspannung bezeichnet.

source: Prototype Shield
de: Prototyp Schild

source: The Prototype Shield makes it easy for you to design custom circuits. You can solder parts to the prototyping area to create your project, or use it with a Tiny breadboard to quickly test circuit ideas without having to solder. It's got extra connections for all of the Arduino I/O pins, and it's got space to mount through-hole and surface mount integrated circuits. It's a convenient way to make your custom circuit and Arduino into a single module.
de: Mit dem Prototype Shield können Sie ganz einfach benutzerdefinierte Schaltkreise entwerfen. Sie können Teile im Prototyping-Bereich löten, um Ihr Projekt zu erstellen, oder es mit einem kleinen Steckbrett verwenden, um Schaltungsideen ohne Löten schnell zu testen. Es bietet zusätzliche Anschlüsse für alle Arduino-E / A-Pins und bietet Platz für die Montage durch Löcher und oberflächenmontierte integrierte Schaltkreise. Dies ist eine bequeme Möglichkeit, Ihre benutzerdefinierte Schaltung und Arduino zu einem einzigen Modul zu machen.

source: **Specifications**
de: **Spezifikationen**

source: It can be overlayed on the Sunfounder Mega2560 board directly. A Tiny breadboard is provided, which you can use to do some simple experiments.
de: Es kann direkt auf das Sunfounder Mega2560-Board gelegt werden. Ein kleines Steckbrett wird mitgeliefert, das Sie für einige einfache Experimente verwenden können.

source: Provide a footprint for SOP28.
de: Stellen Sie einen Footprint für SOP28 bereit.

source: It's got extra connections for all of the Arduino I/O pins
de: Es verfügt über zusätzliche Verbindungen für alle Arduino-E / A-Pins

source: We offer you pin22-pin53 bonding pad and you can use it to weld the component directly.
de: Wir bieten Ihnen ein Pin22-Pin53-Bondpad an, mit dem Sie das Bauteil direkt schweißen können.
