Repository: sunfounder/sunfounder_vincent_kit_for_arduino
Catalog: docs/source/locale/*/LC_MESSAGES/2.32_dht11_module.po
Languages: de

source: 2.32 DHT11 Module
de: 2.32 DHT11-Modul

source: **Overview**
de: **Überblick**

source: In this lesson, you will learn how to use DHT11 Module. The DHT11 is a basic, ultra low-cost digital temperature and humidity sensor. It uses a capacitive humidity sensor and a thermistor to measure the surrounding air, and spits out a digital signal on the data pin (no analog input pins are needed).
de: In dieser Lektion lernen Sie, wie Sie das DHT11-Modul verwenden. Der DHT11 ist ein grundlegender, äußerst kostengünstiger digitaler Temperatur- und Feuchtigkeitssensor. Es verwendet einen kapazitiven Feuchtigkeitssensor und einen Thermistor, um die Umgebungsluft zu messen, und spuckt ein digitales Signal auf den Datenstift aus (es werden keine analogen Eingangsstifte benötigt).

source: **Components Required**
de: **Erforderliche Komponenten**

source: **Component Introduction**
de: **Komponenteneinführung**

source: Only three pins are available: VCC, GND, and DATA. The communication process begins with the DATA line sending start signals to DHT11, and DHT11 receives the signals and returns an answer signal. Then the host receives the answer signal and begins to receive 40-bit humiture data (8-bit humidity integer + 8-bit humidity decimal + 8-bit temperature integer + 8-bit temperature decimal + 8-bit checksum). For more information, please refer to DHT11 datasheet.
de: Es sind nur drei Pins verfügbar: VCC, GND und DATA. Der Kommunikationsprozess beginnt damit, dass die DATA-Leitung Startsignale an DHT11 sendet, und DHT11 empfängt die Signale und gibt ein Antwortsignal zurück. Dann empfängt der Host das Antwortsignal und beginnt mit dem Empfang von 40-Bit-Feuchtigkeitsdaten (8-Bit-Feuchtigkeitszahl + 8-Bit-Feuchtigkeitsdezimalzahl + 8-Bit-Temperaturzahlzahl + 8-Bit-Temperaturdezimalzahl + 8-Bit-Prüfsumme). Weitere Informationen finden Sie im DHT11-Datenblatt.

source: In this example, we can directly connect the pins of DHT11 Module to the pins of Mega 2560 Board, and we use pin 4 to read the signal of DHT11 Module. Connect the pin「+」of DHT11 Module to 5V, the pin「-」 to GND, and the pin OUT to pin 4.
de: In diesem Beispiel können wir die Pins des DHT11-Moduls direkt mit den Pins der Mega 2560-Platine verbinden und mit Pin 4 das Signal des DHT11-Moduls lesen. Verbinden Sie den Pin 「+」 des DHT11-Moduls mit 5 V, den Pin 「-」 mit GND und den Pin OUT mit Pin 4.

source: **Wiring Diagram**
de: **Schaltplan**

source: The codes use the `library dht.h <https://github.com/sunfounder/sunfounder_vincent_kit_for_arduino/tree/master/library>`_. About how to import library, please refer to :ref:`4.1 Add Libraries`.
de: Die Codes verwenden die `Bibliothek dht.h <https://github.com/sunfounder/sunfounder_vincent_kit_for_arduino/tree/master/library>`_. Informationen zum Importieren von Bibliotheken finden Sie in `Teil 4 - 4.1 Hinzufügen von Bibliotheken`.

source: After the codes are uploaded to the Mega2560 board, the serial monitor will continue to output the current temperature and humidity values of the environment.
de: Nach dem Hochladen des Codes auf die Mega2560-Karte gibt der serielle Monitor weiterhin die aktuellen Temperatur- und Feuchtigkeitswerte der Umgebung aus.

source: **Code Analysis**
de: **Code-Analyse**

source: The function of the module is included in the library dht.h.
de: Die Funktion des Moduls ist in der Bibliothek dht.h enthalten.

source: **Library Functions：**
de: **Bibliotheksfunktionen:**

source: Creates a new instance of the dht class that represents a particular DHT-11 module attached to your Arduino board.
de: Erstellt eine neue Instanz der dht-Klasse, die ein bestimmtes DHT-11-Modul darstellt, das an Ihr Arduino-Board angeschlossen ist.

source: This function will return CHECK values.
de: Diese Funktion gibt CHECK-Werte zurück.

source: **DHTLIB_OK** means that DHT-11 is in good condition;
de: **DHTLIB_OK** bedeutet, dass sich DHT-11 in einem guten Zustand befindet;

source: **DHTLIB_ERROR_CHECKSUM** represents that the value may be abnormal;
de: **DHTLIB_ERROR_CHECKSUM** stellt dar, dass der Wert möglicherweise abnormal ist;

source: **DHTLIB_ERROR_TIMEOUT** indicates that there is timeout.
de: **DHTLIB_ERROR_TIMEOUT** zeigt an, dass eine Zeitüberschreitung vorliegt.

source: The function will store the detected humidity and temperature into the variables with the same name in dht class.
de: Die Funktion speichert die erfasste Luftfeuchtigkeit und Temperatur in den gleichnamigen Variablen in der dht-Klasse.

source: The function should be called and used directly in the main program. (e.g. Serial\ **.**\ println\ **(**\ DHT\ **.**\ temperature\ **,**\ 1\ **);**)
de: Die Funktion sollte direkt im Hauptprogramm aufgerufen und verwendet werden. (z.B Seriennummer\ **.**\ println\ **(**\ DHT\ **.**\ temperature\ **,**\ 1\ **);**)

source: **Phenomenon Picture**
de: **Phänomen Bild**
