Repository: sunfounder/sunfounder_vincent_kit_for_arduino
Catalog: docs/source/locale/*/LC_MESSAGES/2.34_mpu6050_module.po
Languages: de

source: 2.34 MPU6050 Module
de: 2.34 MPU6050-Modul

source: **Overview**
de: **Überblick**

source: In this lesson, you will learn how to use MPU6050. MPU-6050 is a 6-axis (combined 3-axis Gyroscope, 3-axis Accelerometer) motion tracking devices. It is often used for augmented reality and electronic image stabilization (EIS: Electronic Image Stabilization), optical image stabilization (OIS: Optical Image Stabilization), "Zero touch" gesture user interface.
de: In dieser Lektion lernen Sie, wie Sie MPU6050 verwenden. MPU-6050 ist ein 6-Achsen-Bewegungsverfolgungsgerät (kombiniertes 3-Achsen-Gyroskop, 3-Achsen-Beschleunigungsmesser). Es wird häufig für Augmented Reality und elektronische Bildstabilisierung (EIS: Elektronische Bildstabilisierung), optische Bildstabilisierung (OIS: Optische Bildstabilisierung) und die Gestenbenutzeroberfläche "Zero Touch" verwendet.

source: **Components Required**
de: **Erforderliche Komponenten**

source: **Component Introduction**
de: **Komponenteneinführung**

source: Its three coordinate systems are defined as follows:
de: Seine drei Koordinatensysteme sind wie folgt definiert:

source: Put MPU6050 flat on the table, assure that the face with label is upward and a dot on this surface is on the top left corner. Then the upright direction upward is the z-axis of the chip. The direction from left to right is regarded as the X-axis. Accordingly the direction from back to front is defined as the Y-axis.
de: Legen Sie die MPU6050 flach auf den Tisch und stellen Sie sicher, dass das Gesicht mit dem Etikett nach oben zeigt und sich ein Punkt auf dieser Oberfläche in der oberen linken Ecke befindet. Dann ist die aufrechte Richtung nach oben die z-Achse des Chips. Die Richtung von links nach rechts wird als X-Achse angesehen. Dementsprechend ist die Richtung von hinten nach vorne als Y-Achse definiert.

source: **Acceleration**
de: **Beschleunigung**

source: The accelerometer works on the principle of piezo electric effect, the ability of certain materials to generate an electric charge in response to applied mechanical stress.
de: Das Arbeitsprinzip von Beschleunigungsmessern ist der piezoelektrische Effekt, dh die Fähigkeit bestimmter Materialien, elektrische Ladungen als Reaktion auf angelegte mechanische Beanspruchungen zu erzeugen.

source: Here, imagine a cuboidal box, having a small ball inside it, like in the picture above. The walls of this box are made with piezo electric crystals. Whenever you tilt the box, the ball is forced to move in the direction of the inclination, due to gravity. The wall with which the ball collides, creates tiny piezo electric currents. There are totally, three pairs of opposite walls in a cuboid. Each pair corresponds to an axis in 3D space: X, Y and Z axes. Depending on the current produced from the piezo electric walls, we can determine the direction of inclination and its magnitude.
de: Stellen Sie sich hier eine quaderförmige Box vor, in der sich eine kleine Kugel befindet, wie im obigen Bild. Die Wände dieser Box bestehen aus piezoelektrischen Kristallen. Immer wenn Sie die Box kippen, muss sich der Ball aufgrund der Schwerkraft in Richtung der Neigung bewegen. Die Wand, mit der die Kugel kollidiert, erzeugt winzige piezoelektrische Ströme. Es gibt insgesamt drei Paare gegenüberliegender Wände in einem Quader. Jedes Paar entspricht einer Achse im 3D-Raum: X-, Y- und Z-Achse. Basierend auf dem von der piezoelektrischen Wand erzeugten Strom können wir die Neigungsrichtung und ihre Amplitude bestimmen.

source: We can use the MPU6050 to detect its acceleration on each coordinate axis (in the stationary desktop state, the Z-axis acceleration is 1 gravity unit, and the X and Y axes are 0). If it is tilted or in a weightless/overweight condition, the corresponding reading will change.
de: Wir können die MPU6050 verwenden, um ihre Beschleunigung auf jeder Koordinatenachse zu ermitteln (im stationären Desktop-Zustand beträgt die Beschleunigung der Z-Achse 1 Schwerkrafteinheit und die X- und Y-Achse 0). Wenn es gekippt ist oder sich in einem schwerelosen / übergewichtigen Zustand befindet, ändert sich der entsprechende Wert.

source: There are four kinds of measuring ranges that can be selected programmatically: +/-2g, +/-4g, +/-8g, and +/-16g (+/-2g by default) corresponding to each precision. Values range from -32768 to 32767.
de: Es gibt vier Arten von Messbereichen, die programmgesteuert ausgewählt werden können: +/- 2 g, +/- 4 g, +/- 8 g und +/- 16 g (standardmäßig +/- 2 g), die jeder Genauigkeit entsprechen. Die Werte reichen von -32768 bis 32767.

source: The reading of accelerometer is converted to an acceleration value by mapping the reading from the reading range to the measuring range.
de: Der Messwert des Beschleunigungsmessers wird in einen Beschleunigungswert umgewandelt, indem der Messwert vom Messbereich auf den Messbereich abgebildet wird.

source: **Acceleration = (Accelerometer axis raw data / 65536 \* full scale Acceleration range) g**
de: **Beschleunigung = (Rohdaten der Beschleunigungsmesserachse / 65536 \* voller Beschleunigungsbereich) g**

source: Take the X-axis as an example, when Accelerometer X axis raw data is 16384 and the range is selected as +/-2g:
de: Nehmen Sie als Beispiel die X-Achse, wenn die Rohdaten der X-Achse des Beschleunigungsmessers 16384 sind und der Bereich als +/- 2 g ausgewählt ist:

source: **Acceleration along the X axis = (16384 / 65536 \* 4) g=1g**
de: **Beschleunigung entlang der X-Achse = (16384/65536 \* 4) g = 1 g**

source: Gyroscopes work on the principle of Coriolis acceleration. Imagine that there is a fork like structure, that is in constant back and forth motion. It is held in place using piezo electric crystals. Whenever, you try to tilt this arrangement, the crystals experience a force in the direction of inclination. This is caused as a result of the inertia of the moving fork. The crystals thus produce a current in consensus with the piezo electric effect, and this current is amplified.
de: Gyroskope arbeiten nach dem Prinzip der Coriolis-Beschleunigung. Stellen Sie sich vor, es gibt eine gabelartige Struktur, die sich ständig hin und her bewegt. Es wird mit piezoelektrischen Kristallen an Ort und Stelle gehalten. Immer wenn Sie versuchen, diese Anordnung zu kippen, erfahren die Kristalle eine Kraft in Neigungsrichtung. Dies wird durch die Trägheit der beweglichen Gabel verursacht. Die Kristalle erzeugen somit einen Strom, der mit dem piezoelektrischen Effekt übereinstimmt, und dieser Strom wird verstärkt.

source: The Gyroscope also has four kinds of measuring ranges: +/- 250, +/- 500, +/- 1000, +/- 2000 (+/-250degree/s by default) . The calculation method and Acceleration are basically consistent.
de: Das Gyroskop verfügt außerdem über vier Arten von Messbereichen: +/- 250, +/- 500, +/- 1000, +/- 2000 (standardmäßig +/- 250 Grad / s). Die Berechnungsmethode und die Beschleunigung sind grundsätzlich konsistent.

source: The formula for converting the reading into angular velocity is as follows:
de: Die Formel zum Umwandeln des Messwerts in die Winkelgeschwindigkeit lautet wie folgt:

source: **Angular velocity = (Gyroscope axis raw data / 65536 \* full scale Gyroscope range) °/s**
de: **Winkelgeschwindigkeit = (Rohdaten der Gyroskopachse / 65536 \* Gyroskopbereich im vollen Maßstab) °/s**

source: The X axis, for example, the Accelerometer X axis raw data is 16384 and ranges + / - 250 ° / s:
de: Die X-Achse, zum Beispiel die Rohdaten der X-Achse des Beschleunigungsmessers, ist 16384 und reicht von +/- 250 ° / s:

source: **Angular velocity along the X axis = (16384 / 65536 \* 500)°/s =125°/s**
de: **Winkelgeschwindigkeit entlang der X-Achse = (16384/65536 \* 500) ° / s = 125 °/s**

source: In this example, we drive MPU6050 with IIC. We inset MPU6050 into the breadboard; get the VCC connected to 5V, GND to GND, SCL to pin SCL 21, and SDA to the pin SDA 20.
de: In diesem Beispiel fahren wir MPU6050 mit IIC. Wir setzen MPU6050 in das Steckbrett ein. Verbinden Sie den VCC mit 5 V, GND mit GND, SCL mit Pin SCL 21 und SDA mit Pin SDA 20.

source: **Schematic Diagram**
de: **Schematische Darstellung**

source: After uploading the codes to the Mega2560 board, you can open the serial monitor to see the gravity acceleration and angular velocity of MPU6050 in each direction.
de: Nach dem Hochladen der Codes auf die Mega2560-Karte können Sie den seriellen Monitor öffnen, um die Schwerkraftbeschleunigung und Winkelgeschwindigkeit der MPU6050 in jede Richtung anzuzeigen.

source: **Code Analysis**
de: **Code-Analyse**

source: In the stationary desktop state, the Z-axis acceleration is 1 gravity unit, and the X and Y axes are 0.
de: Im stationären Desktop-Zustand beträgt die Beschleunigung der Z-Achse 1 Schwerkrafteinheit und die X- und Y-Achse 0.

source: Before your use, you need to calibrate the module, the methods are as follows:
de: Vor Ihrer Verwendung müssen Sie das Modul kalibrieren. Die Methoden sind wie folgt:

source: MPU6050 modules are placed horizontally on the desktop and then you can fix them with clamps or adhesive tape.
de: MPU6050-Module werden horizontal auf dem Desktop platziert und können dann mit Klammern oder Klebeband befestigt werden.

source: Run the sample codes to get the RAW DATA of MPU6050 when it is static.
de: Führen Sie die Beispielcodes aus, um die RAW-DATEN der MPU6050 zu erhalten, wenn diese statisch sind.

source: Add compensation according to the readings when MPU6050 is static.
de: Fügen Sie eine Kompensation gemäß den Messwerten hinzu, wenn die MPU6050 statisch ist.

source: Take MPU6050 we use as an example, and the results of compensation are as follows:
de: Nehmen wir als Beispiel die MPU6050, und die Ergebnisse der Kompensation lauten wie folgt:

source: **Phenomenon Picture**
de: **Phänomen Bild**
