Repository: sunfounder/sunfounder_vincent_kit_for_arduino
Catalog: docs/source/locale/*/LC_MESSAGES/2.4_led_bar_graph.po
Languages: de

source: 2.4 LED Bar Graph
de: 2.4 LED-Balkendiagramm

source: Overview
de: Überblick

source: In this lesson, you will learn something about LED Bar Graph. Generally, LED Bar Graph works as a battery level indicator, Audio equipment, industrial control panel. If we want, we can also find its other application.
de: In dieser Lektion lernen Sie etwas über LED-Balkendiagramme. Im Allgemeinen fungiert das LED-Balkendiagramm als Batteriestandsanzeige, Audiogerät und industrielles Bedienfeld. Wenn wir wollen, können wir auch die andere Anwendung finden.

source: Components Required
de: Erforderliche Komponenten

source: Component Introduction
de: Komponenteneinführung

source: LED Bar Graph is an LED array, which is used to connect with electronic circuit or microcontroller. It’s easy to connect LED bar graph with the circuit like as connecting 10 individual LEDs with 10 output pins.
de: Das LED-Balkendiagramm ist eine Reihe von LEDs, die zur Schnittstelle mit elektronischen Schaltkreisen oder Mikrocontrollern verwendet werden. Es ist einfach, ein LED-Balkendiagramm mit der Schaltung zu verbinden, beispielsweise 10 einzelne LEDs mit 10 Ausgangspins.

source: The anode is the side with a label (1-10).
de: Die Anode ist die Seite mit einem Etikett (1-10).

source: In this example, we use digital pins 2~11 to drive the LED Bar Graph. LED Bar Graph has ten separate LEDs inside and each LED has two pins. The left pins 1~10 of LED Bar Graph are connected with the digital pins 2~11 respectively; the right side pins 11~20 are separately extended to same side of these 220ohm resistors whose other sides are identically connected to GND.
de: In diesem Beispiel verwenden wir die digitalen Pins 2 bis 11, um das LED-Balkendiagramm anzusteuern. Das LED-Balkendiagramm enthält zehn separate LEDs und jede LED verfügt über zwei Pins. Die linken Pins 1-10 des LED-Balkendiagramms sind jeweils mit den digitalen Pins 2-11 verbunden, die rechten Pins 11-20 erstrecken sich jeweils zur gleichen Seite dieser 220-Ohm-Widerstände, und die andere Seite dieser Widerstände ist alle mit GND verbunden.

source: Schematic Diagram
de: Schematische Darstellung

source: Uploaded the codes to the Mega2560 board, you can see that the LEDs on the LED Bar Graph flash in sequence.
de: Wenn Sie die Codes auf die Mega2560-Karte hochgeladen haben, sehen Sie, dass die LEDs auf dem LED-Balkendiagramm nacheinander blinken.

source: Code Analysis
de: Code-Analyse

source: The codes in setup() use the for loop to initialize pins 2~11 to output mode in turn.
de: Die Codes in setup () verwenden die for-Schleife, um die Pins 2 ~ 11 nacheinander in den Ausgabemodus zu initialisieren.

source: The for loop is used in loop() to make the LED flash(turn on 0.5s, then turn off 0.5s) in sequence.
de: Die for-Schleife wird in loop () verwendet, um die LED nacheinander blinken zu lassen (0,5 s einschalten, dann 0.5 s ausschalten).

source: Refer to **Part 1-1.2 Digital Write** for more details about controlling the LED by using digital pins.
de: Weitere Informationen zur Steuerung der LED mithilfe digitaler Pins finden Sie in **Teil 1-1.2 Digital Write**.

source: Phenomenon Picture
de: Phänomen Bild
