Repository: sunfounder/sunfounder_vincent_kit_for_arduino
Catalog: docs/source/locale/*/LC_MESSAGES/2.7_4-digital_7-segment_display.po
Languages: de

source: 2.7 4-Digital 7-Segment Display
de: 2.7 4-digitale 7-Segment-Anzeige

source: Overview
de: Überblick

source: In this lesson, you will learn about the 4-Digital 7-Segment Display. It consists of four 7-segment displays working together so as to display 4 digit numbers.
de: In diesem Lektion lernen Sie eine 4-stellige 7-Segment-Anzeige. Es besteht aus vier 7-Segment-Anzeigen zur Anzeige von 4 Ziffern.

source: Components Required
de: Erforderliche Komponenten

source: Component Introduction
de: Komponenteneinführung

source: The 4-digtal 7-segment display works independently. It uses the principle of human visual persistence to quickly display the characters of each 7-segment in a loop to form continuous strings.
de: Das 4-Digtal-7-Segment-Display arbeitet unabhängig. Es verwendet das Prinzip der visuellen Persistenz des Menschen, um die Zeichen jedes 7-Segments schnell in einer Schleife anzuzeigen und fortlaufende Zeichenfolgen zu bilden.

source: For example, when "1234" is displayed on the display, "1" is displayed on the first 7-segment, and "234" is not displayed. After a period of time, the second 7-segment shows "2", the 1st 3th 4th of 7-segment does not show, and so on, the four digital display show in turn. This process is very short (typically 5ms), and because of the optical afterglow effect and the principle of visual residue, we can see four characters at the same time.
de: Wenn beispielsweise "1234" auf dem Display angezeigt wird, wird "1" auf dem ersten 7-Segment angezeigt und "234" wird nicht angezeigt. Nach einer gewissen Zeit zeigt das zweite 7-Segment "2", das 1. 3. 4. des 7-Segments zeigt nicht usw. Die vier Digitalanzeigen werden der Reihe nach angezeigt. Dieser Vorgang ist sehr kurz (normalerweise 5 ms), und aufgrund des optischen Nachleuchteffekts und des Prinzips der visuellen Rückstände können wir vier Zeichen gleichzeitig sehen.

source: The wiring between the 4-digit 7-segment display and the Mega 2560 Board board is as shown below:
de: Die Verkabelung zwischen dem 4-stelligen 7-Segment-Display und der Mega 2560-Platine ist wie folgt:

source: Schematic Diagram
de: Schematische Darstellung

source: The code uses TimerOne.h library. Refer to **Part 4 - 4.1 Add Libraries** to import library.
de: Der Code verwendet die TimerOne.h-Bibliothek. Siehe Teil 4 - 4.1 Hinzufügen von Bibliotheken zum Importieren der Bibliothek.

source: Code Analysis
de: Code-Analyse

source: There are two points needing your attention:
de: Es gibt zwei Punkte, die Ihre Aufmerksamkeit erfordern:

source: ①Because every segment display works independently in the 4-Digital 7-Segment Display, the principle of visual persistence is applied to quickly display every 7 segment character in turn to form a continuous character string.
de: ①Da jede Segmentanzeige in der 4-stelligen 7-Segment-Anzeige unabhängig arbeitet, ist das Prinzip der visuellen Persistenz geeignet, um jedes 7-Segment-Zeichen nacheinander schnell anzuzeigen, um eine fortlaufende Zeichenfolge zu bilden.

source: Refer to **Part 2 - 2.5 7-Segment Display** to check the details of the number display of the 4-Digital 7-Segment Display.
de: Siehe **Teil 2 - 2.5 7-Segment-Anzeige**, um die Details der Nummernanzeige der 4-digitalen 7-Segment-Anzeige zu überprüfen.

source: ②In this example, a library TimerOne.h is used to realize the function of counting.
de: ②In diesem Beispiel wird eine Bibliothek TimerOne.h verwendet, um die Funktion des Zählens zu realisieren.

source: **Library Functions：**
de: **Bibliotheksfunktionen:**

source: You must call this method first to use any of the other methods. You can optionally specify the timer's period here (in microseconds), by default it is set at 1 second.
de: Sie müssen diese Methode zuerst aufrufen, um eine der anderen Methoden zu verwenden. Optional können Sie hier den Zeitraum des Timers angeben (in Mikrosekunden). Standardmäßig ist er auf 1 Sekunde eingestellt.

source: This breaks analogWrite() for digital pins 9 and 10 on Arduino.
de: Dass dies analogWrite () für die digitalen Pins 9 und 10 auf Arduino unterbricht.

source: Calls a function at the specified interval in microseconds. Be careful about trying to execute too complicated of an interrupt at too high of a frequency, or the CPU may never enter the main loop and your program will 'lock up'. Note that you can optionally set the period with this function if you include a value in microseconds as the last parameter when you call it.
de: Ruft eine Funktion im angegebenen Intervall in Mikrosekunden auf. Seien Sie vorsichtig, wenn Sie versuchen, zu komplexe Interrupts mit einer zu hohen Frequenz auszuführen, da sonst die CPU möglicherweise nie in die Hauptschleife eintritt und Ihr Programm "abstürzt". Bitte beachten Sie, dass Sie, wenn Sie beim Aufrufen den Mikrosekundenwert als letzten Parameter angeben, diese Funktion zum Einstellen des Zeitraums verwenden können.

source: Disables the attached interrupt.
de: Deaktiviert den angeschlossenen Interrupt.

source: Phenomenon Picture
de: Phänomen Bild
