Repository: sunfounder/sunfounder_vincent_kit_for_arduino
Catalog: docs/source/locale/*/LC_MESSAGES/2.8_led_matrix_module.po
Languages: de

source: 2.8 LED Matrix Module
de: 2.8 LED-Matrixmodul

source: Overview
de: Überblick

source: In this lesson, you will learn about LED Matrix Module. LED Matrix Module uses the MAX7219 driver to drive the 8 x 8 LED Matrix.
de: In dieser Lektion lernen Sie das LED-Matrixmodul kennen. Das LED-Matrix-Modul verwendet den MAX7219-Treiber, um die 8 x 8-LED-Matrix anzusteuern.

source: Components Required
de: Erforderliche Komponenten

source: Component Introduction
de: Komponenteneinführung

source: The 64 LEDs are driven by 16 output pins of the IC. The maximum number of LEDs light up at the same time is actually eight. The LEDs are arranged as 8×8 set of rows and columns. So the MAX7219 activates each column for a very short period of time and at the same time it also drives each row. So by rapidly switching through the columns and rows the human eye will only notice a continuous light.
de: Die 64 LEDs werden von 16 Ausgangspins des IC angesteuert. Die maximale Anzahl von LEDs, die gleichzeitig leuchten, beträgt tatsächlich acht. Die LEDs sind als 8 × 8-Satz von Zeilen und Spalten angeordnet. Der MAX7219 aktiviert also jede Spalte für einen sehr kurzen Zeitraum und steuert gleichzeitig auch jede Zeile. Wenn Sie also schnell durch die Spalten und Zeilen wechseln, bemerkt das menschliche Auge nur ein kontinuierliches Licht.

source: These integrated circuits from Maxim are for driving either 64 individual LED's, or up to 8 digits of 7-segment displays. The drivers implement a SPI compatible slave interface that can be controlled from the Arduino using only 3 of the digital output pins.
de: Diese integrierten Schaltkreise von Maxim dienen zur Ansteuerung von 64 einzelnen LEDs oder bis zu 8 Ziffern von 7-Segment-Anzeigen. Der Treiber implementiert eine SPI-kompatible Slave-Schnittstelle, die von Arduino über nur 3 digitale Ausgangspins gesteuert werden kann.

source: In this example, we get the VCC pin of MAX7219 connected to 5V, GND to ground, DIN to digital pin 12, CS to digital pin 10, CLK to digital pin 11.
de: In diesem Beispiel wird der VCC-Pin von MAX7219 an 5 V, GND an Masse, DIN an Digital-Pin 12, CS an Digital-Pin 10, CLK an Digital-Pin 11 angeschlossen.

source: Schematic Diagram
de: Schematische Darstellung

source: The codes use the library LedControl.h, and please refer to **Part 4 - 4.1 Add Libraries to add in the library to Arduino IDE**.
de: Die Codes verwenden die Bibliothek LedControl.h. Weitere Informationen finden Sie in **Teil 4 - 4.1 Hinzufügen von Bibliotheken zum Hinzufügen in der Bibliothek zur Arduino IDE**.

source: After the codes are uploaded, you can see that the LEDs turn on in the sequence of a column, a row or a dot or there is a picture appearing on the LED matrix.
de: Nach dem Hochladen des Codes leuchten die LEDs in der Reihenfolge der Spalten, Zeilen oder Punkte auf, oder Bilder erscheinen auf der LED-Matrix.

source: Code Analysis
de: Code-Analyse

source: By calling the library LedControl.h, you can easily use the LED matrix.
de: Durch Aufrufen der Bibliothek LedControl.h können Sie die LED-Matrix problemlos verwenden.

source: **Library Functions：**
de: **Bibliotheksfunktionen:**

source: Create an instance of type LedControl through which we talk to the MAX7219 devices. The initialization of an LedControl takes 4 arguments.
de: Erstellen Sie eine Instanz vom Typ LedControl, über die wir mit den MAX7219-Geräten kommunizieren. Die Initialisierung eines LedControl erfordert 4 Argumente.

source: **dataPin,clockPin,csPin**: The first 3 arguments are the pin-numbers on the Arduino that are connected to the MAX7219. You are free to choose any of the digital IO-pins on the arduino, but since some of the pins are also used for serial communication or have a led attached to them its best to avoid pin 0,1 and 13.
de: **dataPin, clockPin, csPin**: Die ersten drei Argumente sind die Pin-Nummern auf dem Arduino, die mit dem MAX7219 verbunden sind. Sie können einen beliebigen digitalen E / A-Pin am Arduino auswählen. Da jedoch einige Pins auch für die serielle Kommunikation verwendet oder mit LEDs verbunden werden, sollten Sie die Pins 0, 1 und 13 vermeiden..

source: **numDevices**: The fourth argument is the number of cascaded MAX7219 devices you're using with this LedControl. The library can address up to 8 devices from a single LedControl-variable.
de: **numDevices**: Das vierte Argument ist die Anzahl der kaskadierten MAX7219-Geräte, die Sie mit diesem LedControl verwenden. Die Bibliothek kann bis zu 8 Geräte aus einer einzigen LedControl-Variablen adressieren.

source: **addr**: The address of the display to control.
de: **addr**: Die Adresse des zu steuernden Displays.

source: **b**: If true the device goes into power-down mode. If false device goes into normal operation.
de: **b**: Wenn true, wechselt das Gerät in den Ausschaltmodus. Wenn falsches Gerät in den normalen Betrieb geht.

source: Themethod lets you control brightness in 16 discrete steps. Larger values make the display brighter up to the maximum of 15.
de: Mit dieser Methode können Sie die Helligkeit in 16 diskreten Schritten steuern. Bei größeren Werten wird die Anzeige bis maximal 15 heller.

source: **intensity**: the brightness of the display. Only values between 0(darkest) and 15(brightest) are valid.
de: **intensity**: die Helligkeit des Displays. Es sind nur Werte zwischen 0 (am dunkelsten) und 15 (am hellsten) gültig.

source: All LEDs off after this one.
de: Alle LEDs aus nach diesem.

source: Set the status of a single Led.
de: Stellen Sie den Status einer einzelnen LED ein.

source: **row**: The row of the Led (0..7).
de: **row**: Die Zeile der LED (0..7).

source: **col**: The column of the Led (0..7).
de: **col**: Die Spalte der LED (0..7).

source: **state**: If true the led is switched on, if false it is switched off.
de: **state**: Wenn true, ist die LED eingeschaltet, wenn false, ist sie ausgeschaltet.

source: Set all 8 LEDs in a row to a new state.
de: Stellen Sie alle 8 LEDs hintereinander auf einen neuen Status.

source: **row**: Row which is to be set (0..7).
de: **row**: Zeile, die gesetzt werden soll (0..7).

source: **value**: Each bit set to 1 will light up the corresponding Led.(e.g. B01000000 will light up the 2nd).
de: **value**: Jedes auf 1 gesetzte Bit leuchtet die entsprechende LED auf (z. B. leuchtet B01000000 die zweite auf).

source: **col**: Column which is to be set (0..7).
de: **col**: Spalte, die gesetzt werden soll (0..7).

source: Phenomenon Picture
de: Phänomen Bild
