Repository: sunfounder/sunfounder_vincent_kit_for_arduino
Catalog: docs/source/locale/*/LC_MESSAGES/2.9_i2c_lcd1602_module.po
Languages: de

source: 2.9 I2C LCD1602 Module
de: 2.9 I2C LCD1602-Modul

source: Overview
de: Überblick

source: In this lesson, you will learn about LCD1602. LCD1602, or 1602 character-type liquid crystal display, a kind of dot matrix module to show letters, numbers, characters and so on.
de: In dieser Lektion lernen Sie LCD1602. Flüssigkristallanzeige vom Typ LCD1602 oder 1602, eine Art Punktmatrixmodul zur Anzeige von Buchstaben, Zahlen, Zeichen usw.

source: Components Required
de: Erforderliche Komponenten

source: Component Introduction
de: Komponenteneinführung

source: It's composed of 5x7 or 5x11 dot matrix positions; each position can display one character. There's a dot pitch between two characters and a space between lines, thus separating characters and lines. The number 1602 means on the display, 2 rows can be showed and 16 characters in each.
de: Es besteht aus 5x7- oder 5x11-Punktmatrixpositionen. Jede Position kann ein Zeichen anzeigen. Es gibt einen Punktabstand zwischen zwei Zeichen und ein Leerzeichen zwischen den Zeilen, wodurch Zeichen und Zeilen getrennt werden. Die Zahl 1602 bedeutet, dass auf dem Display 2 Zeilen mit jeweils 16 Zeichen angezeigt werden können.

source: As we all know, though LCD and some other displays greatly enrich the man-machine interaction, they share a common weakness. When they are connected to a controller, multiple IOs will be occupied of the controller which has no so many outer ports. Also it restricts other functions of the controller. Therefore, LCD1602 with an I2C bus is developed to solve the problem.
de: Wie wir alle wissen, bereichern LCD und einige andere Displays die Mensch-Maschine-Interaktion erheblich, weisen jedoch eine gemeinsame Schwäche auf. Wenn sie mit einem Controller verbunden sind, werden mehrere E / A des Controllers belegt, der nicht so viele äußere Ports hat. Es schränkt auch andere Funktionen der Steuerung ein. Daher wurde LCD1602 mit einem I2C-Bus entwickelt, um das Problem zu lösen.

source: I2C communication
de: I2C-Kommunikation

source: I2C(Inter-Integrated Circuit) bus is a very popular and powerful bus for communication between a master device (or master devices) and a single or multiple slave devices. I2C main controller can be used to control IO expander, various sensors, EEPROM, ADC/DAC and so on. All of these are controlled only by the two pins of host, the serial data (SDA) line and the serial clock line(SCL).
de: Der I2C-Bus (Inter-Integrated Circuit) ist ein sehr beliebter und leistungsstarker Bus, der für die Kommunikation zwischen einem oder mehreren Master-Geräten und einzelnen oder mehreren Slave-Geräten verwendet wird. Der I2C-Hauptcontroller kann zur Steuerung des E / A-Expanders, verschiedener Sensoren, des EEPROM, des ADC / DAC usw. verwendet werden. Alle diese werden nur von den beiden Pins des Hosts gesteuert, der seriellen Datenleitung (SDA) und der seriellen Taktleitung (SCL).

source: In this example, we will get the first pin GND of LCD1602 connected to GND, the second pin VCC to 5V, the third pin SDA to the pin SDA 20 and the forth pin SCL to the pin SCL 21.
de: In diesem Beispiel wird der erste Pin GND des LCD1602 mit GND verbunden, der zweite Pin VCC mit 5 V, der dritte Pin SDA mit dem Pin SDA 20 und der vierte Pin SCL mit dem Pin SCL 21.

source: Schematic Diagram
de: Schematische Darstellung

source: The SDA and SCL of the Mega2560 board are the pins 20 and 21.
de: SDA und SCL der Mega2560-Karte sind die Pins 20 und 21.

source: The libraries Wire.h and LiquidCrystal_I2C.h are used in these codes, Wire.h is built in Arduino, but LiquidCrystal_I2C.h needs adding manually. Add Method: Refer to **Part 4 - 4.1 Add Libraries**
de: Die Bibliotheken Wire.h und LiquidCrystal_I2C.h werden in diesen Codes verwendet. Wire.h wird in Arduino erstellt, LiquidCrystal_I2C.h muss jedoch manuell hinzugefügt werden. Methode hinzufügen: Siehe **Teil 4 - 4.1 Bibliotheken hinzufügen**.

source: Upload the codes to the Mega2560 board, the content that you input in the serial monitor will be printed on the LCD.
de: Laden Sie die Codes auf die Mega2560-Karte hoch. Der Inhalt, den Sie in den seriellen Monitor eingeben, wird auf dem LCD gedruckt.

source: About the ASCII code and the character input in the serial monitor, please refer to Part 1-1.8 Serial Read.
de: Informationen zum ASCII-Code und zur Zeicheneingabe im seriellen Monitor finden Sie in Teil 1-1.8 Serial Read.

source: Code Analysis
de: Code-Analyse

source: By calling the library LiquidCrystal_I2C.h, you can easily drive the LCD.
de: Durch Aufrufen der Bibliothek LiquidCrystal_I2C.h können Sie das LCD problemlos steuern.

source: **Library Functions：**
de: **Bibliotheksfunktionen:**

source: Creates a new instance of the LiquidCrystal_I2C class that represents a particular LCD attached to your Arduino board.
de: Erstellen Sie eine neue Instanz der LiquidCrystal_I2C-Klasse, die ein bestimmtes LCD darstellt, das mit der Arduino-Karte verbunden ist.

source: **lcd_AddR**: The address of the LCD defaults to 0x27.
de: **lcd_AddR**: Die Adresse des LCD ist standardmäßig 0x27.

source: **lcd_cols**: The LCD1602 has 16 columns.
de: **lcd_cols**: Der LCD1602 hat 16 Spalten.

source: **lcd_rows**: The LCD1602 has 2 rows.
de: **lcd_rows**: Der LCD1602 hat 2 Zeilen.

source: Initialize the lcd.
de: Initialisieren Sie den LCD.

source: Turn the (optional) backlight on.
de: Schalten Sie die (optionale) Hintergrundbeleuchtung ein.

source: Turn the (optional) backlight off.
de: Schalten Sie die (optionale) Hintergrundbeleuchtung aus.

source: Turn the LCD display on.
de: Schalten Sie das LCD-Display ein.

source: Turn the LCD display off quickly.
de: Schalten Sie das LCD-Display schnell aus.

source: Clear display, set cursor position to zero.
de: Anzeige löschen, Cursorposition auf Null setzen.

source: Set the cursor position to col,row.
de: Setzen Sie die Cursorposition auf col, row.

source: Prints text to the LCD.
de: Druckt Text auf das LCD.

source: **data**: The data to print (char, byte, int, long, or string).
de: **data**: Die zu druckenden Daten (char, byte, int, long oder string).

source: **BASE (optional)**: The base in which to print numbers: BIN for binary (base 2), DEC for decimal (base 10), OCT for octal (base 8), HEX for hexadecimal (base 16).
de: **BASE (optional)**: Die Basis, in der Zahlen gedruckt werden sollen: BIN für Binär (Basis 2), DEC für Dezimal (Basis 10), OCT für Oktal (Basis 8), HEX für Hexadezimal (Basis 16).

source: Phenomenon Picture
de: Phänomen Bild
