Repository: sunfounder/sunfounder_vincent_kit_for_arduino
Catalog: docs/source/locale/*/LC_MESSAGES/3.5_Access_Control_System.po
Languages: de

source: 3.5 Access Control System
de: 3.5 Zugangskontrollsystem

source: **Overview**
de: **Überblick**

source: The access control system is the system that is used to control the entrance channel, which is developed on the basis of the traditional door lock. The traditional mechanical door lock is only a simple mechanical device, and no matter how reasonable the structural design is, how strong the material is, people can always open it through various means. The key to the entrance and exit (like an office building, a hotel room) is cumbersome. If the key is missed or replaced, the lock is to be replaced with the key. In order to solve these problems, the electronic magnetic card lock and the electronic coded lock are present, which has raised the management level of the access channel to a certain extent, and then the channel management enters into the electronic age.
de: Das Zugangskontrollsystem ist das System zur Steuerung des Eingangskanals, das auf Basis des traditionellen Türschlosses entwickelt wird. Das traditionelle mechanische Türschloss ist nur ein einfaches mechanisches Gerät, egal wie vernünftig das Strukturdesign ist, wie stark das Material ist, Menschen können es auf verschiedene Arten öffnen. Der Schlüssel zum Ein- und Ausgang (wie ein Bürogebäude, ein Hotelzimmer) ist umständlich. Wird der Schlüssel übersehen oder ersetzt, ist das Schloss durch den Schlüssel zu ersetzen. Um diese Probleme zu lösen, gibt es elektronische Magnetkartenschlösser und elektronische Code-Schlösser, die die Verwaltungsebene der Zugangskanäle bis zu einem gewissen Grad verbessert haben, und dann ist die Kanalverwaltung in das elektronische Zeitalter eingetreten.

source: **Components Required**
de: **Erforderliche Komponenten**

source: In this example, Power Supply Module is used to power the breadboard. We get the GND of Mega 2560 Board connected to the cathode rail of the breadboard, GND of ULN2003 to the cathode rail of the breadboard, VCC to 5V OUTPUT of Power Supply and the Stepper Motor to OUT1-OUT5 of ULN.
de: In diesem Beispiel wird das Stromversorgungsmodul zum Versorgen des Steckbretts verwendet. Wir erhalten die GND der Mega 2560-Platine, die an die Kathodenschiene des Steckbretts angeschlossen ist, die GND von ULN2003 an die Kathodenschiene des Steckbretts, die VCC an den 5-V-Ausgang der Stromversorgung und den Schrittmotor an OUT1-OUT5 von ULN.

source: **Schematic Diagram**
de: **Schematische Darstellung**

source: **Example Explanation**
de: **Beispiel Erklärung**

source: The workflow of the access control system is shown in the flow chart.
de: Der Workflow des Zugangskontrollsystems wird im Flussdiagramm angezeigt.

source: When there is no authorized ID identified (the variable “Approved” equals to 0), the device will perform functions of ID identification and password identification.
de: Wenn keine autorisierte ID identifiziert wurde (die Variable “Genehmigt” entspricht 0), führt das Gerät Funktionen zur ID-Identifizierung und Kennwortidentifizierung aus.

source: If the authorized ID is identified (“Approved” equals to 1), the door will open. After that, the door will be closed a few seconds later and the identified status will be reset (“Approved” equals to 0).
de: Wenn die autorisierte ID identifiziert wird (“Genehmigt” entspricht 1), öffnet sich die Tür. Danach wird die Tür einige Sekunden später geschlossen und der identifizierte Status zurückgesetzt (“Genehmigt” entspricht 0).

source: In addition to the core access control function, the project also uses LCD and active buzzer to complete the work of the user interaction system of the access control system.
de: Zusätzlich zur zentralen Zugriffssteuerungsfunktion verwendet das Projekt auch LCD und aktiven Summer, um die Arbeit des Benutzerinteraktionssystems des Zugriffskontrollsystems abzuschließen.

source: **Phenomenon Picture**
de: **Phänomen Bild**
