Repository: sunfounder/sunfounder_vincent_kit_for_arduino
Catalog: docs/source/locale/*/LC_MESSAGES/introduction.po
Languages: de

source: Introduction
de: Vorstellung

source: This book, as a tutorial or a handbook, can be divided into four parts:
de: Dieses Buch kann als Tutorial oder Handbuch in vier Teile unterteilt werden:

source: **Part 1：Basic**
de: **Teil 1: Grundlegend**

source: This section includes Arduino-related materials, including IDE installation and basic functions (read, write, serial communication, etc.).
de: Dieser Abschnitt enthält Arduino-bezogene Materialien, einschließlich IDE-Installation und Grundfunktionen (Lesen, Schreiben, serielle Kommunikation usw.).

source: **Part 2：Component**
de: **Teil 2: Komponente**

source: This part includes all components and modules of Vincent Kit, and explains their working principles and codes. If you view the directory carefully, you will find that the use of the output device is introduced first, and then the use of the input device. The input device is also divided into switched input and sensor input.
de: Dieser Teil enthält alle Komponenten und Module von Vincent Kit und erläutert deren Funktionsprinzipien und Codes. Wenn Sie das Verzeichnis sorgfältig anzeigen, werden Sie feststellen, dass zuerst die Verwendung des Ausgabegeräts und dann die Verwendung des Eingabegeräts eingeführt wird. Eingabegeräte sind auch in Schaltereingang und Sensoreingang unterteilt.

source: **Part 3：Example**
de: **Teil 3: Beispiel**

source: This section includes several sample programs written by Sunfounder that you can refer to when finishing some interesting projects of Vincent Kit.
de: Dieser Abschnitt enthält mehrere von Sunfounder geschriebene Beispielprogramme, die als Referenz für die Fertigstellung einiger interessanter Projekte des Vincent Kits verwendet werden können.

source: **Part 4：Appendix**
de: **Teil 4: Anhang**

source: This section contains the extension function of Arduino IDE, and currently includes the method of adding libraries. We look forward to your project and hope that you who have read this document will come to our forum to share the results when you finish the project.
de: Dieser Abschnitt enthält die Erweiterungsfunktion von Arduino IDE und enthält derzeit die Methode zum Hinzufügen von Bibliotheken. Wir freuen uns auf Ihr Projekt und hoffen, dass Sie, die dieses Dokument gelesen haben, die Ergebnisse nach Abschluss des.
